# Chapter 2: Mortality

In [1]:
import pandas as pd

## Get the data

In [2]:
mortality_url = "https://data.cdc.gov/api/views/v6ab-adf5/rows.csv?accessType=DOWNLOAD"
mortality_data = pd.read_csv(mortality_url)

### Save and restore the DataFrame

In [3]:
mortality_data.to_pickle('mortality_data.pkl')

In [4]:
mortality_data = pd.read_pickle('mortality_data.pkl')

## Examine and clean the data

### Display the data

In [5]:
mortality_data

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
3    1903    1-4 Years      1542.1
4    1904    1-4 Years      1591.5
..    ...          ...         ...
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

In [6]:
mortality_data.head()

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [7]:
mortality_data.tail(3)

     Year    Age Group  Death Rate
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

In [8]:
display(mortality_data)

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
3    1903    1-4 Years      1542.1
4    1904    1-4 Years      1591.5
..    ...          ...         ...
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

In [9]:
with pd.option_context(
    'display.max_rows', 5,
    'display.max_columns', None):
    display(mortality_data)

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
..    ...          ...         ...
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

### Display the DataFrame attributes

In [10]:
mortality_data.values

array([[1900, '1-4 Years', 1983.8],
       [1901, '1-4 Years', 1695.0],
       [1902, '1-4 Years', 1655.7],
       ...,
       [2016, '15-19 Years', 51.2],
       [2017, '15-19 Years', 51.5],
       [2018, '15-19 Years', 49.2]], dtype=object)

In [11]:
print("Index:  ", mortality_data.index)
print("Columns:", mortality_data.columns)
print("Size:   ", mortality_data.size)
print("Shape:  ", mortality_data.shape)

Index:   RangeIndex(start=0, stop=476, step=1)
Columns: Index(['Year', 'Age Group', 'Death Rate'], dtype='object')
Size:    1428
Shape:   (476, 3)

### Use the columns attribute to change the column names

In [12]:
mortality_data.columns = mortality_data.columns.str.replace(" ", "")

In [13]:
print(mortality_data.columns)

Index(['Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [14]:
mortality_data.head()

   Year   AgeGroup  DeathRate
0  1900  1-4 Years     1983.8
1  1901  1-4 Years     1695.0
2  1902  1-4 Years     1655.7
3  1903  1-4 Years     1542.1
4  1904  1-4 Years     1591.5

### Use the info(), nunique(), and describe() methods

In [15]:
mortality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       476 non-null    int64
 1   AgeGroup   476 non-null    object
 2   DeathRate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

In [16]:
mortality_data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       476 non-null    int64
 1   AgeGroup   476 non-null    object
 2   DeathRate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 38.7 KB

In [17]:
mortality_data.nunique()

Year         119
AgeGroup       4
DeathRate    430
dtype: int64

In [18]:
mortality_data.describe()

              Year    DeathRate
count   476.000000   476.000000
mean   1959.000000   192.924160
std      34.387268   293.224216
min    1900.000000    11.400000
25%    1929.000000    40.575000
50%    1959.000000    89.500000
75%    1989.000000   222.575000
max    2018.000000  1983.800000

In [19]:
mortality_data.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,476.0,1959.00000,34.387268,1900.0,1929.000,1959.0,1989.000,2018.0
DeathRate,476.0,192.92416,293.224216,11.4,40.575,89.5,222.575,1983.8

### Save and restore the cleaned DataFrame

In [20]:
mortality_data.to_pickle('mortality_cleaned.pkl')

In [21]:
mortality_data = pd.read_pickle('mortality_cleaned.pkl')
mortality_data.head()

   Year   AgeGroup  DeathRate
0  1900  1-4 Years     1983.8
1  1901  1-4 Years     1695.0
2  1902  1-4 Years     1655.7
3  1903  1-4 Years     1542.1
4  1904  1-4 Years     1591.5

## Access the data

### How to access columns

In [22]:
mortality_data.DeathRate.head(2)

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [23]:
type(mortality_data.DeathRate)

pandas.core.series.Series

In [24]:
mortality_data['DeathRate'].head(2)

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [25]:
type(mortality_data['DeathRate'])

pandas.core.series.Series

In [26]:
mortality_data[['Year','DeathRate']].head(2)

   Year  DeathRate
0  1900     1983.8
1  1901     1695.0

In [27]:
type(mortality_data[['Year','DeathRate']])

pandas.core.frame.DataFrame

### How to access rows

In [28]:
mortality_data.query('Year==1900')

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
119  1900    5-9 Years      466.1
238  1900  10-14 Years      298.3
357  1900  15-19 Years      484.8

In [29]:
mortality_data.query('Year == 2000 and AgeGroup != "1-4 Years"')

     Year     AgeGroup  DeathRate
219  2000    5-9 Years       15.8
338  2000  10-14 Years       20.3
457  2000  15-19 Years       67.1

In [30]:
mortality_data.query('Year == 1900 or Year == 2000').head()

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
100  2000    1-4 Years       32.4
119  1900    5-9 Years      466.1
219  2000    5-9 Years       15.8
238  1900  10-14 Years      298.3

In [31]:
# use backticks if a column name contains spaces
# mortality_data.query('Year == 2000 and `Age Group` != "1-4 Years"')

### How to access a subset of rows and columns

In [32]:
mortality_data.query('Year == 1900').DeathRate.head()

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [33]:
mortality_data.query('Year == 1900')['DeathRate'].head()

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [34]:
mortality_data.query('Year == 1900')[['DeathRate']].head()

     DeathRate
0       1983.8
119      466.1
238      298.3
357      484.8

In [35]:
mortality_data.query('Year == 1900')[['AgeGroup','DeathRate']].head()

        AgeGroup  DeathRate
0      1-4 Years     1983.8
119    5-9 Years      466.1
238  10-14 Years      298.3
357  15-19 Years      484.8

### How to access rows with the loc[] accessor

In [36]:
mortality_data.loc[[0,5,10]]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3

In [37]:
mortality_data.loc[4:6]

   Year   AgeGroup  DeathRate
4  1904  1-4 Years     1591.5
5  1905  1-4 Years     1498.9
6  1906  1-4 Years     1580.0

In [38]:
mortality_data.loc[0:20:5]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3
15  1915  1-4 Years      924.2
20  1920  1-4 Years      987.2

In [39]:
mortality_data.loc[mortality_data.Year == 1917]

     Year     AgeGroup  DeathRate
17   1917    1-4 Years     1066.0
136  1917    5-9 Years      290.7
255  1917  10-14 Years      218.9
374  1917  15-19 Years      380.3

### How to access columns with the loc[] accessor

In [40]:
mortality_data.loc[:, ['Year', 'AgeGroup']]

     Year     AgeGroup
0    1900    1-4 Years
1    1901    1-4 Years
2    1902    1-4 Years
3    1903    1-4 Years
4    1904    1-4 Years
..    ...          ...
471  2014  15-19 Years
472  2015  15-19 Years
473  2016  15-19 Years
474  2017  15-19 Years
475  2018  15-19 Years

[476 rows x 2 columns]

### How to access a subset of rows and columns with the loc[] accessor

In [41]:
mortality_data.loc[[0,5,10],['AgeGroup','DeathRate']]

     AgeGroup  DeathRate
0   1-4 Years     1983.8
5   1-4 Years     1498.9
10  1-4 Years     1397.3

In [42]:
mortality_data.loc[4:6,'AgeGroup':'DeathRate']

    AgeGroup  DeathRate
4  1-4 Years     1591.5
5  1-4 Years     1498.9
6  1-4 Years     1580.0

### How to access rows with the iloc[] accessor

In [43]:
mortality_data.iloc[[0,5,10]]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3

In [44]:
mortality_data.iloc[4:6]

   Year   AgeGroup  DeathRate
4  1904  1-4 Years     1591.5
5  1905  1-4 Years     1498.9

In [45]:
mortality_data.iloc[0:20:5]

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
5   1905  1-4 Years     1498.9
10  1910  1-4 Years     1397.3
15  1915  1-4 Years      924.2

### How to access a subset of rows and columns with the iloc[] accessor

In [46]:
mortality_data.iloc[[0,5,10],[1,2]]

     AgeGroup  DeathRate
0   1-4 Years     1983.8
5   1-4 Years     1498.9
10  1-4 Years     1397.3

In [47]:
mortality_data.iloc[4:7,1:3]

    AgeGroup  DeathRate
4  1-4 Years     1591.5
5  1-4 Years     1498.9
6  1-4 Years     1580.0

In [48]:
mortality_data.iloc[-10:]

     Year     AgeGroup  DeathRate
466  2009  15-19 Years       51.9
467  2010  15-19 Years       49.4
468  2011  15-19 Years       48.9
469  2012  15-19 Years       47.2
470  2013  15-19 Years       44.8
471  2014  15-19 Years       45.5
472  2015  15-19 Years       48.3
473  2016  15-19 Years       51.2
474  2017  15-19 Years       51.5
475  2018  15-19 Years       49.2

## Prepare the data

### Sort the data

In [49]:
mortality_data.sort_values('AgeGroup').head()

    Year   AgeGroup  DeathRate
0   1900  1-4 Years     1983.8
87  1987  1-4 Years       52.1
86  1986  1-4 Years       52.4
85  1985  1-4 Years       51.8
84  1984  1-4 Years       52.2

In [50]:
mortality_data.sort_values('AgeGroup', ascending=False).head(20)

     Year   AgeGroup  DeathRate
148  1929  5-9 Years      208.0
120  1901  5-9 Years      427.6
152  1933  5-9 Years      161.3
153  1934  5-9 Years      165.1
154  1935  5-9 Years      162.4
155  1936  5-9 Years      154.6
156  1937  5-9 Years      142.9
157  1938  5-9 Years      128.8
158  1939  5-9 Years      112.6
159  1940  5-9 Years      108.3
160  1941  5-9 Years      103.8
161  1942  5-9 Years       96.1
162  1943  5-9 Years      103.1
163  1944  5-9 Years       98.7
164  1945  5-9 Years       93.6
165  1946  5-9 Years       85.6
166  1947  5-9 Years       73.3
167  1948  5-9 Years       70.6
168  1949  5-9 Years       68.2
169  1950  5-9 Years       61.7

In [51]:
mortality_data.sort_values(['Year','DeathRate']).head(3)

     Year     AgeGroup  DeathRate
238  1900  10-14 Years      298.3
119  1900    5-9 Years      466.1
357  1900  15-19 Years      484.8

In [52]:
mortality_data.sort_values(['Year','DeathRate'],
                           ascending=[True,False]).head()

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
357  1900  15-19 Years      484.8
119  1900    5-9 Years      466.1
238  1900  10-14 Years      298.3
1    1901    1-4 Years     1695.0

In [53]:
mortality_data.sort_values(['DeathRate','Year'],
                           ascending=[False,True]).head()

   Year   AgeGroup  DeathRate
0  1900  1-4 Years     1983.8
1  1901  1-4 Years     1695.0
2  1902  1-4 Years     1655.7
4  1904  1-4 Years     1591.5
6  1906  1-4 Years     1580.0

### Apply statistical methods

In [54]:
mortality_data.DeathRate.mean()

192.92415966386554

In [55]:
mortality_data[['AgeGroup','DeathRate']].max()

AgeGroup     5-9 Years
DeathRate       1983.8
dtype: object

In [56]:
mortality_data.count()

Year         476
AgeGroup     476
DeathRate    476
dtype: int64

In [57]:
mortality_data.quantile([.25,.75])

        Year  DeathRate
0.25  1929.0     40.575
0.75  1989.0    222.575

In [58]:
mortality_data['DeathRate'].cumsum()

0       1983.8
1       3678.8
2       5334.5
3       6876.6
4       8468.1
        ...
471    91631.7
472    91680.0
473    91731.2
474    91782.7
475    91831.9
Name: DeathRate, Length: 476, dtype: float64

### Use Python for column arithmetic

In [59]:
mortality_data['MeanCentered'] = \
    mortality_data.DeathRate - mortality_data.DeathRate.mean()

In [60]:
mortality_data

     Year     AgeGroup  DeathRate  MeanCentered
0    1900    1-4 Years     1983.8    1790.87584
1    1901    1-4 Years     1695.0    1502.07584
2    1902    1-4 Years     1655.7    1462.77584
3    1903    1-4 Years     1542.1    1349.17584
4    1904    1-4 Years     1591.5    1398.57584
..    ...          ...        ...           ...
471  2014  15-19 Years       45.5    -147.42416
472  2015  15-19 Years       48.3    -144.62416
473  2016  15-19 Years       51.2    -141.72416
474  2017  15-19 Years       51.5    -141.42416
475  2018  15-19 Years       49.2    -143.72416

[476 rows x 4 columns]

In [61]:
mortality_data['DeathRate'] = mortality_data.DeathRate / 100000

In [62]:
mortality_data.head()

   Year   AgeGroup  DeathRate  MeanCentered
0  1900  1-4 Years   0.019838    1790.87584
1  1901  1-4 Years   0.016950    1502.07584
2  1902  1-4 Years   0.016557    1462.77584
3  1903  1-4 Years   0.015421    1349.17584
4  1904  1-4 Years   0.015915    1398.57584

### Modify the string data in a column

In [63]:
mortality_data.AgeGroup.replace(
    {'1-4 Years':'01-04 Years','5-9 Years':'05-09 Years'},
    inplace = True)

In [64]:
mortality_data.AgeGroup.replace(
    to_replace = ['1-4 Years','5-9 Years'],
    value = ['01-04 Years','05-09 Years'],
    inplace = True)

In [65]:
# mortality_data['AgeGroup'] = mortality_data.AgeGroup.str.replace('1-4 Years','01-04 Years')
# mortality_data['AgeGroup'] = mortality_data.AgeGroup.str.replace('5-9 Years','05-09 Years')

In [66]:
mortality_data

     Year     AgeGroup  DeathRate  MeanCentered
0    1900  01-04 Years   0.019838    1790.87584
1    1901  01-04 Years   0.016950    1502.07584
2    1902  01-04 Years   0.016557    1462.77584
3    1903  01-04 Years   0.015421    1349.17584
4    1904  01-04 Years   0.015915    1398.57584
..    ...          ...        ...           ...
471  2014  15-19 Years   0.000455    -147.42416
472  2015  15-19 Years   0.000483    -144.62416
473  2016  15-19 Years   0.000512    -141.72416
474  2017  15-19 Years   0.000515    -141.42416
475  2018  15-19 Years   0.000492    -143.72416

[476 rows x 4 columns]

### Save and restore the prepared DataFrame

In [67]:
mortality_data.to_pickle('mortality_prepped.pkl')

In [68]:
mortality_data = pd.read_pickle('mortality_prepped.pkl')
mortality_data.head()

   Year     AgeGroup  DeathRate  MeanCentered
0  1900  01-04 Years   0.019838    1790.87584
1  1901  01-04 Years   0.016950    1502.07584
2  1902  01-04 Years   0.016557    1462.77584
3  1903  01-04 Years   0.015421    1349.17584
4  1904  01-04 Years   0.015915    1398.57584

## Shape the data

### Set and use an index

In [69]:
mortality_data.head(2)

   Year     AgeGroup  DeathRate  MeanCentered
0  1900  01-04 Years   0.019838    1790.87584
1  1901  01-04 Years   0.016950    1502.07584

In [70]:
mortality_data = mortality_data.set_index('Year')
mortality_data.head(2)

         AgeGroup  DeathRate  MeanCentered
Year
1900  01-04 Years   0.019838    1790.87584
1901  01-04 Years   0.016950    1502.07584

In [71]:
mortality_data.reset_index(inplace=True)

In [72]:
mortality_data = mortality_data.set_index(
    ['Year','AgeGroup'],verify_integrity=True)
mortality_data.head(2)

                  DeathRate  MeanCentered
Year AgeGroup
1900 01-04 Years   0.019838    1790.87584
1901 01-04 Years   0.016950    1502.07584

In [73]:
mortality_data.reset_index(inplace=True)

In [74]:
mortality_data.head(2)

   Year     AgeGroup  DeathRate  MeanCentered
0  1900  01-04 Years   0.019838    1790.87584
1  1901  01-04 Years   0.016950    1502.07584

### Pivot the data

In [75]:
mortality_wide = mortality_data.pivot(
    index="Year",columns="AgeGroup")
mortality_wide.head(3)

           DeathRate                                     MeanCentered  \
AgeGroup 01-04 Years 05-09 Years 10-14 Years 15-19 Years  01-04 Years
Year
1900        0.019838    0.004661    0.002983    0.004848   1790.87584
1901        0.016950    0.004276    0.002736    0.004544   1502.07584
1902        0.016557    0.004033    0.002525    0.004215   1462.77584


AgeGroup 05-09 Years 10-14 Years 15-19 Years
Year
1900       273.17584   105.37584   291.87584
1901       234.67584    80.67584   261.47584
1902       210.37584    59.57584   228.57584

In [76]:
mortality_wide = mortality_data.pivot(
    index="Year",columns="AgeGroup",values="DeathRate")
mortality_wide.head(3)

AgeGroup  01-04 Years  05-09 Years  10-14 Years  15-19 Years
Year
1900         0.019838     0.004661     0.002983     0.004848
1901         0.016950     0.004276     0.002736     0.004544
1902         0.016557     0.004033     0.002525     0.004215

### Melt the data

In [77]:
mortality_wide.to_excel('mortality_wide.xlsx')

In [78]:
mortality_wide = pd.read_excel('mortality_wide.xlsx')
mortality_wide.head(4)

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [ ]:
mortality_long = mortality_wide.melt(
    id_vars = 'Year',
    value_vars=['01-04 Years','05-09 Years'],
    var_name ='AgeGroup',
    value_name='DeathRate')
mortality_long.head(4)
with pd.option_context('display.max_rows', 4):
    display(mortality_long)

### Save and restore the wide DataFrame

In [ ]:
mortality_wide.to_pickle('mortality_wide.pkl')

In [ ]:
mortality_wide = pd.read_pickle('mortality_wide.pkl')
mortality_wide.head()

## Analyze the data

### Group the data

In [ ]:
mortality_data.head()

In [ ]:
mortality_data.groupby('AgeGroup').mean()

In [ ]:
mortality_data.groupby('Year').median().head(4)

In [ ]:
mortality_data.groupby(['Year','AgeGroup']).count().head()

In [ ]:
mortality_data.groupby('AgeGroup')['DeathRate'].describe()

### Aggregate the data

In [ ]:
mortality_data.groupby('AgeGroup').agg(['mean','median'])

In [ ]:
mortality_data.groupby('AgeGroup')['DeathRate'] \
    .agg(['mean','median','std','nunique'])

In [ ]:
mortality_data.groupby('Year')['DeathRate'] \
    .agg(['mean','median','std','min','max','var','nunique'])

## Visualize the data

In [ ]:
mortality_data.pivot(index='Year',columns='AgeGroup')['DeathRate'].plot()

In [ ]:
mortality_data.groupby('AgeGroup')['DeathRate'] \
    .agg(['mean','median','std']).plot.barh()